package com.bigdata.yls_bigdata_es.test_like;

/**
 * @Auther: yls
 * @Date: 2020/5/8 12:00
 * @Description:
 * @Version 1.0
 */
public class Test {
    public static void main(String[] args) {
        String str = "赵钱孙李周吴郑王\n" +
                "冯陈褚卫蒋沈韩杨\n" +
                "朱秦尤许何吕施张\n" +
                "孔曹严华金魏陶姜\n" +
                "戚谢邹喻柏水窦章\n" +
                "云苏潘葛奚范彭郎\n" +
                "鲁韦昌马苗凤花方\n" +
                "俞任袁柳酆鲍史唐\n" +
                "费廉岑薛雷贺倪汤\n" +
                "滕殷罗毕郝邬安常\n" +
                "乐于时傅皮卞齐康\n" +
                "伍余元卜顾孟平黄\n" +
                "和穆萧尹姚邵湛汪\n" +
                "祁毛禹狄米贝明臧\n" +
                "计伏成戴谈宋茅庞\n" +
                "熊纪舒屈项祝董梁\n" +
                "杜阮蓝闵席季麻强\n" +
                "贾路娄危江童颜郭\n" +
                "梅盛林刁钟徐邱骆\n" +
                "高夏蔡田樊胡凌霍\n" +
                "虞万支柯昝管卢莫\n" +
                "经房裘缪干解应宗\n" +
                "丁宣贲邓郁单杭洪\n" +
                "包诸左石崔吉钮龚\n" +
                "程嵇邢滑裴陆荣翁\n" +
                "荀羊於惠甄曲家封\n" +
                "芮羿储靳汲邴糜松\n" +
                "井段富巫乌焦巴弓\n" +
                "牧隗山谷车侯宓蓬\n" +
                "全郗班仰秋仲伊宫\n" +
                "宁仇栾暴甘钭厉戎\n" +
                "祖武符刘景詹束龙\n" +
                "叶幸司韶郜黎蓟薄\n" +
                "印宿白怀蒲邰从鄂\n" +
                "索咸籍赖卓蔺屠蒙\n" +
                "池乔阴鬱胥能苍双\n" +
                "闻莘党翟谭贡劳逄\n" +
                "姬申扶堵冉宰郦雍\n" +
                "卻璩桑桂濮牛寿通\n" +
                "边扈燕冀郏浦尚农\n" +
                "温别庄晏柴瞿阎充\n" +
                "慕连茹习宦艾鱼容\n" +
                "向古易慎戈廖庾终\n" +
                "暨居衡步都耿满弘\n" +
                "匡国文寇广禄阙东\n" +
                "欧殳沃利蔚越夔隆\n" +
                "师巩厍聂晁勾敖融\n" +
                "冷訾辛阚那简饶空\n" +
                "曾毋沙乜养鞠须丰\n" +
                "巢关蒯相查后荆红\n" +
                "游竺权逯盖益桓公\n" +
                "万俟司马上官欧阳\n" +
                "夏侯诸葛闻人东方\n" +
                "赫连皇甫尉迟公羊\n" +
                "澹台公冶宗政濮阳\n" +
                "淳于单于太叔申屠\n" +
                "公孙仲孙轩辕令狐\n" +
                "钟离宇文长孙慕容\n" +
                "鲜于闾丘司徒司空\n" +
                "丌官司寇仉督子车\n" +
                "颛孙端木巫马公西\n" +
                "漆雕乐正壤驷公良\n" +
                "拓跋夹谷宰父谷梁\n" +
                "晋楚闫法汝鄢涂钦\n" +
                "段干百里东郭南门\n" +
                "呼延归海羊舌微生\n" +
                "岳帅缑亢况郈有琴\n" +
                "梁丘左丘东门西门\n" +
                "商牟佘佴伯赏南宫\n" +
                "墨哈谯笪年爱阳佟\n" +
                "第五言福百家姓终";

        char[] s = str.toCharArray();
        System.out.println(s[0]);
    }
}
